python/05.dict.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-02-09 Sat 21:45 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>字典</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jinghui Hu" />
</head>
<body>
<div id="content">
<h1 class="title">字典</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgcb85fbd">1. 基本操作</a></li>
<li><a href="#orgee7a07c">2. 浅拷贝和深拷贝</a></li>
<li><a href="#org752297e">3. 常见操作</a></li>
<li><a href="#orgbb2e0d7">4. 获取字典的值</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgcb85fbd" class="outline-2">
<h2 id="orgcb85fbd"><span class="section-number-2">1</span> 基本操作</h2>
<div class="outline-text-2" id="text-1">
<p>
字典的添加、删除、修改
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">items</span> = <span style="color: #8d5649;">[</span><span style="color: #d8241f;">(</span><span style="color: #2aa198;">'name'</span>, <span style="color: #2aa198;">'Jeanhwea'</span><span style="color: #d8241f;">)</span>, <span style="color: #d8241f;">(</span><span style="color: #2aa198;">'age'</span>, <span style="color: #2aa198;">'24'</span><span style="color: #d8241f;">)</span><span style="color: #8d5649;">]</span>
<span style="color: #6c71c4;">d</span> = <span style="color: #6c71c4;">dict</span><span style="color: #8d5649;">(</span>items<span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>d<span style="color: #d8241f;">[</span><span style="color: #2aa198;">'name'</span><span style="color: #d8241f;">]</span><span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">d</span><span style="color: #8d5649;">[</span><span style="color: #2aa198;">'gender'</span><span style="color: #8d5649;">]</span> = <span style="color: #2aa198;">'man'</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>d<span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">len</span><span style="color: #8d5649;">(</span>d<span style="color: #8d5649;">)</span> <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&gt;&gt;&gt; 3</span>
<span style="color: #859900;">del</span> d<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'age'</span><span style="color: #8d5649;">]</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>d<span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span><span style="color: #2aa198;">'name'</span> <span style="color: #859900;">in</span> d<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
Jeanhwea
{'name': 'Jeanhwea', 'age': '24', 'gender': 'man'}
{'name': 'Jeanhwea', 'gender': 'man'}
True

</pre>

<p>
关于字典引用的相关操作
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">xdic</span> = <span style="color: #8d5649;">{}</span>
<span style="color: #6c71c4;">xdic</span><span style="color: #8d5649;">[</span><span style="color: #2aa198;">'key'</span><span style="color: #8d5649;">]</span> = <span style="color: #2aa198;">'value'</span>
<span style="color: #6c71c4;">ydic</span> = xdic
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>ydic<span style="color: #8d5649;">)</span>
xdic.clear<span style="color: #8d5649;">()</span> <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">clear xdic</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>ydic<span style="color: #8d5649;">)</span>

<span style="color: #6c71c4;">xdic</span><span style="color: #8d5649;">[</span><span style="color: #2aa198;">'key'</span><span style="color: #8d5649;">]</span> = <span style="color: #2aa198;">'value'</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>ydic<span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">xdic</span> = <span style="color: #8d5649;">{}</span> <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">bind a empty dict to x</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>ydic<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
{'key': 'value'}
{}
{'key': 'value'}
{'key': 'value'}

</pre>
</div>
</div>


<div id="outline-container-orgee7a07c" class="outline-2">
<h2 id="orgee7a07c"><span class="section-number-2">2</span> 浅拷贝和深拷贝</h2>
<div class="outline-text-2" id="text-2">
<p>
字典也有浅拷贝和深拷贝的区别，具体见下面代码。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">shallow copy</span>
<span style="color: #6c71c4;">x</span> = <span style="color: #8d5649;">{</span> <span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Jeanhwea'</span>, <span style="color: #2aa198;">'friends'</span>: <span style="color: #d8241f;">[</span><span style="color: #2aa198;">'Jack'</span>, <span style="color: #2aa198;">'Alice'</span><span style="color: #d8241f;">]</span> <span style="color: #8d5649;">}</span>
<span style="color: #6c71c4;">y</span> = x.copy<span style="color: #8d5649;">()</span>
<span style="color: #6c71c4;">y</span><span style="color: #8d5649;">[</span><span style="color: #2aa198;">'name'</span><span style="color: #8d5649;">]</span> = <span style="color: #2aa198;">'Wang'</span>
y<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'friends'</span><span style="color: #8d5649;">]</span>.remove<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'Jack'</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>x, y<span style="color: #8d5649;">)</span>

<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">deep copy</span>
<span style="color: #6c71c4;">x</span> = <span style="color: #8d5649;">{</span> <span style="color: #2aa198;">'name'</span>: <span style="color: #2aa198;">'Jeanhwea'</span>, <span style="color: #2aa198;">'friends'</span>: <span style="color: #d8241f;">[</span><span style="color: #2aa198;">'Jack'</span>, <span style="color: #2aa198;">'Alice'</span><span style="color: #d8241f;">]</span> <span style="color: #8d5649;">}</span>
<span style="color: #859900;">from</span> copy <span style="color: #859900;">import</span> deepcopy
<span style="color: #6c71c4;">y</span> = deepcopy<span style="color: #8d5649;">(</span>x<span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">y</span><span style="color: #8d5649;">[</span><span style="color: #2aa198;">'name'</span><span style="color: #8d5649;">]</span> = <span style="color: #2aa198;">'Wang'</span>
y<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'friends'</span><span style="color: #8d5649;">]</span>.remove<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'Jack'</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>x, y<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
{'name': 'Jeanhwea', 'friends': ['Alice']} {'name': 'Wang', 'friends': ['Alice']}
{'name': 'Jeanhwea', 'friends': ['Jack', 'Alice']} {'name': 'Wang', 'friends': ['Alice']}

</pre>
</div>
</div>


<div id="outline-container-org752297e" class="outline-2">
<h2 id="org752297e"><span class="section-number-2">3</span> 常见操作</h2>
<div class="outline-text-2" id="text-3">
<p>
<code>fromkeys</code> 通过列表生成字典。查字典时， <code>get</code> 方法不会引起异常，直接索引会引起异
常。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">keys</span> = <span style="color: #8d5649;">[</span><span style="color: #2aa198;">'a'</span>, <span style="color: #2aa198;">'b'</span>, <span style="color: #2aa198;">'c'</span><span style="color: #8d5649;">]</span>
<span style="color: #8d5649;">{}</span>.fromkeys<span style="color: #8d5649;">(</span>keys<span style="color: #8d5649;">)</span> <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&gt;&gt;&gt; {'a': None, 'c': None, 'b': None}</span>
<span style="color: #8d5649;">{}</span>.fromkeys<span style="color: #8d5649;">(</span>keys, <span style="color: #2aa198;">'(none)'</span><span style="color: #8d5649;">)</span> <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&gt;&gt;&gt; {'a': '(none)', 'c': '(none)', 'b': '(none)'}</span>


<span style="color: #6c71c4;">xdic</span> = <span style="color: #8d5649;">{</span><span style="color: #2aa198;">'a'</span>: <span style="color: #2aa198;">'aa'</span>, <span style="color: #2aa198;">'b'</span>: <span style="color: #2aa198;">'bb'</span><span style="color: #8d5649;">}</span>
<span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">xdic['c'] will cause a error</span>
<span style="color: #d33682;">'''</span>
<span style="color: #d33682;">Traceback (most recent call last):</span>
<span style="color: #d33682;">  File "05-dict.py", line 51, in &lt;module&gt;</span>
<span style="color: #d33682;">    xdic['c']</span>
<span style="color: #d33682;">KeyError: 'c'</span>
<span style="color: #d33682;">'''</span>
xdic.get<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'c'</span><span style="color: #8d5649;">)</span> <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&gt;&gt;&gt; None</span>
<span style="color: #6c71c4;">xdic</span> = <span style="color: #8d5649;">{</span><span style="color: #2aa198;">'a'</span>: <span style="color: #2aa198;">'aa'</span>, <span style="color: #2aa198;">'b'</span>: <span style="color: #2aa198;">'bb'</span><span style="color: #8d5649;">}</span>
</pre>
</div>

<p>
<code>has_key</code> 在 Python3.x 中已经弃用，建议用 <code>in</code> 关键字判断是否在字典中。字典还有
一些迭代器，具体见下面代码。
</p>

<div class="org-src-container">
<pre class="src src-python">xdic.has_key<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'a'</span><span style="color: #8d5649;">)</span> <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&gt;&gt;&gt; True</span>
xdic.has_key<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'c'</span><span style="color: #8d5649;">)</span> <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&gt;&gt;&gt; False</span>

<span style="color: #6c71c4;">xdic</span><span style="color: #8d5649;">[</span><span style="color: #2aa198;">'c'</span><span style="color: #8d5649;">]</span> = <span style="color: #2aa198;">'cc'</span>
xdic.items<span style="color: #8d5649;">()</span> <span style="color: #586e75; font-style: italic;">#</span><span style="color: #586e75; font-style: italic;">&gt;&gt;&gt; [('a', 'aa'), ('c', 'cc'), ('b', 'bb')]</span>
<span style="color: #859900;">for</span> k, v <span style="color: #859900;">in</span> xdic.iteritems<span style="color: #8d5649;">()</span>:
    <span style="color: #859900;">pass</span>
<span style="color: #859900;">for</span> v <span style="color: #859900;">in</span> xdic.itervalues<span style="color: #8d5649;">()</span>:
    <span style="color: #859900;">pass</span>
<span style="color: #859900;">for</span> k <span style="color: #859900;">in</span> xdic.iterkeys<span style="color: #8d5649;">()</span>:
    <span style="color: #859900;">pass</span>
</pre>
</div>

<p>
<code>update</code> 方法通过一个字典的内容来替换另外一个字典。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">dic</span> = <span style="color: #8d5649;">{</span><span style="color: #2aa198;">'title'</span>: <span style="color: #2aa198;">'aaaa'</span>, <span style="color: #2aa198;">'url'</span>: <span style="color: #2aa198;">'http://jeanhwea.github.io'</span>, <span style="color: #2aa198;">'content'</span>: <span style="color: #2aa198;">'nothing'</span><span style="color: #8d5649;">}</span>
<span style="color: #6c71c4;">x</span> = <span style="color: #8d5649;">{</span><span style="color: #2aa198;">'title'</span>: <span style="color: #2aa198;">'bbbb'</span>, <span style="color: #2aa198;">'url'</span>: <span style="color: #2aa198;">'http://www.github.com/jeanhwea'</span><span style="color: #8d5649;">}</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>dic<span style="color: #8d5649;">)</span>
dic.update<span style="color: #8d5649;">(</span>x<span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>dic<span style="color: #8d5649;">)</span>
</pre>
</div>

<pre class="example">
{'title': 'aaaa', 'url': 'http://jeanhwea.github.io', 'content': 'nothing'}
{'title': 'bbbb', 'url': 'http://www.github.com/jeanhwea', 'content': 'nothing'}

</pre>
</div>
</div>


<div id="outline-container-orgbb2e0d7" class="outline-2">
<h2 id="orgbb2e0d7"><span class="section-number-2">4</span> 获取字典的值</h2>
<div class="outline-text-2" id="text-4">
<p>
<code>setdefault</code> 用于设置字典的默认值，如果元素存在则返回元素的值，并将值写入字典。
<code>get</code> 方法有同样的取值效果，但是不会将字典中不存在的值写入字典中。
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #6c71c4;">da</span> = <span style="color: #8d5649;">{</span><span style="color: #2aa198;">'a'</span>: <span style="color: #2aa198;">'apple'</span><span style="color: #8d5649;">}</span>
<span style="color: #6c71c4;">a</span> = da.setdefault<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'a'</span>, <span style="color: #2aa198;">'none'</span><span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">b</span> = da.setdefault<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'b'</span>, <span style="color: #2aa198;">'none'</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>da<span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>a, b<span style="color: #8d5649;">)</span>

<span style="color: #6c71c4;">db</span> = <span style="color: #8d5649;">{</span><span style="color: #2aa198;">'a'</span>: <span style="color: #2aa198;">'apple'</span><span style="color: #8d5649;">}</span>
<span style="color: #6c71c4;">a</span> = db.get<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'a'</span>, <span style="color: #2aa198;">'none'</span><span style="color: #8d5649;">)</span>
<span style="color: #6c71c4;">b</span> = db.get<span style="color: #8d5649;">(</span><span style="color: #2aa198;">'b'</span>, <span style="color: #2aa198;">'none'</span><span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>db<span style="color: #8d5649;">)</span>
<span style="color: #859900;">print</span><span style="color: #8d5649;">(</span>a, b<span style="color: #8d5649;">)</span>

db<span style="color: #8d5649;">[</span><span style="color: #2aa198;">'b'</span><span style="color: #8d5649;">]</span> <span style="color: #586e75; font-style: italic;"># </span><span style="color: #586e75; font-style: italic;">raise KeyError</span>
</pre>
</div>

<pre class="example">
{'a': 'apple', 'b': 'none'}
apple none
{'a': 'apple'}
apple none
Traceback (most recent call last):
  File "&lt;stdin&gt;", line 1, in &lt;module&gt;
  File "/var/folders/zv/mx8xm0m92_b1fwtchhz7dn6c0000gn/T/babel-zrDlJg/python-SRNjD3", line 13, in &lt;module&gt;
    db['b']
KeyError: 'b'

</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2018-10-23 Tue 00:00</p>
<p class="author">Author: Jinghui Hu</p>
<p class="date">Created: 2019-02-09 Sat 21:45</p>
</div>
</body>
</html>
